{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "591fd955-bb51-4335-a865-6cf92c8b7b34",
   "metadata": {},
   "source": [
    "# Forming graph for prediction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4136a438-a1fe-4656-bba1-ff2b1bda50dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The autoreload extension is already loaded. To reload it, use:\n",
      "  %reload_ext autoreload\n"
     ]
    }
   ],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "b60283ae-7ede-43af-873d-65bac7f5df19",
   "metadata": {},
   "outputs": [],
   "source": [
    "import kg_generation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "798472a2-1a29-468d-95fa-58faa96f2fc9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import db, config, StructuredNode, RelationshipTo, RelationshipFrom\n",
    "\n",
    "# Neomodel connection\n",
    "config.DATABASE_NAME = 'version1'\n",
    "db.set_connection(url='bolt://neo4j:12345678@localhost:7687')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "da547ca8-f738-4a5c-9b08-15d97192a6cd",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.cypher_query(\"MATCH ()-[r:IS_A]-() DELETE r\");\n",
    "db.cypher_query(\"MATCH ()-[r:VERB2]-() DELETE r\");\n",
    "db.cypher_query(\"MATCH ()-[r:COSINE_SIM]-() DELETE r\");\n",
    "db.cypher_query(\"MATCH (n:MergedNode) DELETE n\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "9b88f711-2909-404e-90dd-3c8b20d7cc3a",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# setting a common label\n",
    "db.cypher_query(\"Match (a:HeadOrTail)<-[r1:ANNOTATES]-(b:Class)-[r2:ANNOTATES]->(e:Entity) SET a:RelevantNode return a\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "28118f64-14b7-40a5-b093-b766fb915afa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[1561]], ['count(a)'])"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"MATCH (a:RelevantNode) return count(a)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c22bf22d-6155-40ad-9e08-68c44ba82726",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.10.2+cu102\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Special tokens have been added in the vocabulary, make sure the associated word embeddings are fine-tuned or trained.\n",
      "Some weights of the model checkpoint at allenai/scibert_scivocab_uncased were not used when initializing BertModel: ['cls.predictions.decoder.bias', 'cls.predictions.transform.LayerNorm.weight', 'cls.predictions.transform.dense.weight', 'cls.predictions.bias', 'cls.predictions.decoder.weight', 'cls.predictions.transform.dense.bias', 'cls.predictions.transform.LayerNorm.bias', 'cls.seq_relationship.bias', 'cls.seq_relationship.weight']\n",
      "- This IS expected if you are initializing BertModel from the checkpoint of a model trained on another task or with another architecture (e.g. initializing a BertForSequenceClassification model from a BertForPreTraining model).\n",
      "- This IS NOT expected if you are initializing BertModel from the checkpoint of a model that you expect to be exactly identical (initializing a BertForSequenceClassification model from a BertForSequenceClassification model).\n"
     ]
    }
   ],
   "source": [
    "from transformers import AutoTokenizer, AutoModel, AutoModelForMaskedLM\n",
    "import torch\n",
    "print(torch.__version__)\n",
    "tokenizer = AutoTokenizer.from_pretrained('allenai/scibert_scivocab_uncased')\n",
    "model = AutoModel.from_pretrained('allenai/scibert_scivocab_uncased')\n",
    "\n",
    "def entity_sim(entityA,entityB):\n",
    "    with torch.no_grad():\n",
    "        tokenA = tokenizer(entityA, padding=True, truncation=True, return_tensors=\"pt\")\n",
    "        tokenB = tokenizer(entityB, padding=True, truncation=True, return_tensors=\"pt\")\n",
    "        embA = model(**tokenA).last_hidden_state.mean(dim=1)\n",
    "        embB = model(**tokenB).last_hidden_state.mean(dim=1)\n",
    "        return torch.nn.functional.cosine_similarity(embA, embB).item()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "127d222d-3226-477d-95bd-14e1ee836222",
   "metadata": {},
   "source": [
    "import pandas as pd\n",
    "scores = []\n",
    "terms1 = []\n",
    "ids1 = []\n",
    "terms2 = []\n",
    "ids2 = []\n",
    "results = db.cypher_query(\"MATCH (a:RelevantNode) return a.text,ID(a)\")\n",
    "df = pd.DataFrame(results[0],columns=results[1])\n",
    "for i in range(len(df)):\n",
    "    term1,id1 = df.iloc[i]\n",
    "    for j in range(i+1,len(df)):\n",
    "        term2,id2 = df.iloc[j]\n",
    "        terms1.append(term1)\n",
    "        terms2.append(term2)\n",
    "        ids1.append(id1)\n",
    "        ids2.append(id2)\n",
    "        scores.append(entity_sim(term1,term2))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "f19d9794-e86d-47b9-b1e2-66693cc27f73",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[94571]], ['count(*)'])"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = db.cypher_query(\"MATCH (a1:RelevantNode)-[r1:ANNOTATES]-(c:Class)-[r2:ANNOTATES]-(a2:RelevantNode) WITH a1,a2,count(c) as n MERGE (a1)-[r3:SHARED_ANNOTATION {n:n}]-(a2) return count(*)\")\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "b8f2be39-7bb8-47f7-80ef-f91abcb0fcaa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n1.text</th>\n",
       "      <th>ID(n1)</th>\n",
       "      <th>n2.text</th>\n",
       "      <th>ID(n2)</th>\n",
       "      <th>r.n</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>decrease in pain intensity</td>\n",
       "      <td>10747</td>\n",
       "      <td>Baseline pain intensity</td>\n",
       "      <td>59266</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>decrease in pain intensity</td>\n",
       "      <td>10747</td>\n",
       "      <td>pain intensity</td>\n",
       "      <td>10994</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>decrease in pain intensity</td>\n",
       "      <td>10747</td>\n",
       "      <td>pain intensity improvement</td>\n",
       "      <td>44416</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>decrease in pain intensity</td>\n",
       "      <td>10747</td>\n",
       "      <td>pain intensity</td>\n",
       "      <td>59373</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>decrease in pain intensity</td>\n",
       "      <td>10747</td>\n",
       "      <td>pain intensity</td>\n",
       "      <td>10932</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      n1.text  ID(n1)                     n2.text  ID(n2)  r.n\n",
       "0  decrease in pain intensity   10747     Baseline pain intensity   59266   27\n",
       "1  decrease in pain intensity   10747              pain intensity   10994   27\n",
       "2  decrease in pain intensity   10747  pain intensity improvement   44416   27\n",
       "3  decrease in pain intensity   10747              pain intensity   59373   27\n",
       "4  decrease in pain intensity   10747              pain intensity   10932   27"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "results = db.cypher_query(\"match (n1:RelevantNode)-[r:SHARED_ANNOTATION]-(n2:RelevantNode) where r.n > 25 MERGE (n1)-[r2:SIM_ANNOTATION {threshold:25}]-(n2) return n1.text,ID(n1),n2.text,ID(n2),r.n\")\n",
    "df = pd.DataFrame(results[0],columns=results[1])\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "ea6a8349-c1e8-4664-a97c-bed43590ccfb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1940, 5)"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "570bac22-2c4c-495d-a254-9a83514893c3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n1.text</th>\n",
       "      <th>ID(n1)</th>\n",
       "      <th>n2.text</th>\n",
       "      <th>ID(n2)</th>\n",
       "      <th>r.n</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>pain interference</td>\n",
       "      <td>10788</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>59616</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>pain interference</td>\n",
       "      <td>10788</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>46732</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>pain interference</td>\n",
       "      <td>10788</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>79246</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>pain interference</td>\n",
       "      <td>10788</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>59617</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1909</th>\n",
       "      <td>Back pain</td>\n",
       "      <td>132888</td>\n",
       "      <td>chronic pain</td>\n",
       "      <td>45020</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1423</th>\n",
       "      <td>positive outcomes</td>\n",
       "      <td>87658</td>\n",
       "      <td>positive mood</td>\n",
       "      <td>20693</td>\n",
       "      <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1424</th>\n",
       "      <td>positive outcomes</td>\n",
       "      <td>87658</td>\n",
       "      <td>positive outcomes</td>\n",
       "      <td>87657</td>\n",
       "      <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1186</th>\n",
       "      <td>positive changes</td>\n",
       "      <td>75376</td>\n",
       "      <td>positive outcomes</td>\n",
       "      <td>87658</td>\n",
       "      <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>248</th>\n",
       "      <td>positive mood</td>\n",
       "      <td>20690</td>\n",
       "      <td>positive mood</td>\n",
       "      <td>20693</td>\n",
       "      <td>102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>255</th>\n",
       "      <td>positive mood</td>\n",
       "      <td>20693</td>\n",
       "      <td>positive mood</td>\n",
       "      <td>20690</td>\n",
       "      <td>102</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1940 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                n1.text  ID(n1)            n2.text  ID(n2)  r.n\n",
       "63    pain interference   10788  pain interference   59616   26\n",
       "49    pain interference   10788  pain interference   46732   26\n",
       "50    pain interference   10788  pain interference   79246   26\n",
       "51    pain interference   10788  pain interference   59617   26\n",
       "1909          Back pain  132888       chronic pain   45020   26\n",
       "...                 ...     ...                ...     ...  ...\n",
       "1423  positive outcomes   87658      positive mood   20693   91\n",
       "1424  positive outcomes   87658  positive outcomes   87657   91\n",
       "1186   positive changes   75376  positive outcomes   87658   91\n",
       "248       positive mood   20690      positive mood   20693  102\n",
       "255       positive mood   20693      positive mood   20690  102\n",
       "\n",
       "[1940 rows x 5 columns]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.sort_values(by='r.n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "bd703b96-dbdd-4d08-a149-96943c902f08",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.0\n",
      "5.154639175257731\n",
      "10.309278350515463\n",
      "15.463917525773196\n",
      "20.618556701030926\n",
      "HTTP code 502 from API (<html>\n",
      "<head><title>502 Bad Gateway</title></head>\n",
      "<body>\n",
      "<center><h1>502 Bad Gateway</h1></center>\n",
      "<hr><center>cloudflare</center>\n",
      "</body>\n",
      "</html>\n",
      ")\n",
      "Trying openai for 2 time\n",
      "25.773195876288657\n",
      "30.927835051546392\n",
      "Timed out generating response. Please try again with a shorter prompt or with `max_tokens` set to a lower value. {\n",
      "    \"error\": {\n",
      "        \"message\": \"Timed out generating response. Please try again with a shorter prompt or with `max_tokens` set to a lower value.\",\n",
      "        \"type\": \"internal_error\",\n",
      "        \"param\": null,\n",
      "        \"code\": \"request_timeout\"\n",
      "    }\n",
      "}\n",
      " 500 {'error': {'message': 'Timed out generating response. Please try again with a shorter prompt or with `max_tokens` set to a lower value.', 'type': 'internal_error', 'param': None, 'code': 'request_timeout'}} {'Date': 'Thu, 22 Feb 2024 07:16:35 GMT', 'Content-Type': 'application/json; charset=utf-8', 'Content-Length': '251', 'Connection': 'keep-alive', 'vary': 'Origin', 'x-request-id': 'req_64ead0097e0ecf474548de9f7ab36c31', 'strict-transport-security': 'max-age=15724800; includeSubDomains', 'CF-Cache-Status': 'DYNAMIC', 'Server': 'cloudflare', 'CF-RAY': '859563230caa641d-SJC', 'alt-svc': 'h3=\":443\"; ma=86400'}\n",
      "Trying openai for 2 time\n",
      "36.08247422680412\n",
      "41.23711340206185\n",
      "Timed out generating response. Please try again with a shorter prompt or with `max_tokens` set to a lower value. {\n",
      "    \"error\": {\n",
      "        \"message\": \"Timed out generating response. Please try again with a shorter prompt or with `max_tokens` set to a lower value.\",\n",
      "        \"type\": \"internal_error\",\n",
      "        \"param\": null,\n",
      "        \"code\": \"request_timeout\"\n",
      "    }\n",
      "}\n",
      " 500 {'error': {'message': 'Timed out generating response. Please try again with a shorter prompt or with `max_tokens` set to a lower value.', 'type': 'internal_error', 'param': None, 'code': 'request_timeout'}} {'Date': 'Thu, 22 Feb 2024 07:27:35 GMT', 'Content-Type': 'application/json; charset=utf-8', 'Content-Length': '251', 'Connection': 'keep-alive', 'vary': 'Origin', 'x-request-id': 'req_896ec350c781a85cc3e8768baa22e40e', 'strict-transport-security': 'max-age=15724800; includeSubDomains', 'CF-Cache-Status': 'DYNAMIC', 'Server': 'cloudflare', 'CF-RAY': '85957341db0496cb-SJC', 'alt-svc': 'h3=\":443\"; ma=86400'}\n",
      "Trying openai for 2 time\n",
      "46.391752577319586\n",
      "51.546391752577314\n",
      "56.70103092783505\n",
      "61.855670103092784\n",
      "67.0103092783505\n",
      "72.16494845360825\n",
      "77.31958762886599\n",
      "82.4742268041237\n",
      "87.62886597938144\n",
      "92.78350515463917\n",
      "97.9381443298969\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "#results = db.cypher_query(\"MATCH (a:RelevantNode) return a.text,ID(a)\")\n",
    "#df = pd.DataFrame(results[0],columns=results[1])\n",
    "for i,ix in enumerate(df.index):\n",
    "    term1,id1,term2,id2,n = df.loc[ix]\n",
    "    if kg_generation.linking.is_same_openai(term1,term2):\n",
    "        db.cypher_query(\"MATCH (a1:RelevantNode {text:$term1}),(a2:RelevantNode {text:$term2}) WHERE ID(a1)=$id1 AND ID(a2)=$id2 MERGE (a1)-[:IS_SAME]-(a2) return *\",params={\"term1\":term1,\"term2\":term2,\"id1\":id1,\"id2\":id2})\n",
    "    if i%100==0:\n",
    "        print(i/len(df)*100)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "31b05051-df23-425b-a25a-2f931e117ce5",
   "metadata": {},
   "outputs": [],
   "source": [
    "try:\n",
    "    db.cypher_query(\"CALL gds.graph.drop('simGraph') YIELD graphName;\")\n",
    "except:\n",
    "    pass # graph exists\n",
    "\n",
    "# CALL gds.graph.project(\n",
    "#   'myGraph',\n",
    "#   'RelevantNode',\n",
    "#   'COSINE_SIM',\n",
    "#   {\n",
    "#   }\n",
    "# )\n",
    "\n",
    "# sim graph\n",
    "db.cypher_query(\n",
    "    \"\"\"\n",
    "CALL gds.graph.project(\n",
    "  'simGraph',\n",
    "  'RelevantNode',\n",
    "  'IS_SAME',\n",
    "  {\n",
    "  }\n",
    ")\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "db.cypher_query(\"\"\"\n",
    " CALL gds.wcc.stream('simGraph')\n",
    " YIELD componentId, nodeId\n",
    " WITH gds.util.asNode(nodeId) AS n, componentId AS componentId\n",
    " SET n.componentId=componentId\n",
    " RETURN n\n",
    "\"\"\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "e8d3a1b8-9cad-412c-b27e-4e9106419565",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.cypher_query(\"\"\"\n",
    "MATCH (z:RelevantNode) with COUNT(z.componentId) as c, z.componentId as componentId\n",
    "MERGE (b:MergedNode {componentId: componentId})\n",
    "return count(*)\n",
    "\"\"\");\n",
    "\n",
    "db.cypher_query(\"MATCH (z:MergedNode), (b:RelevantNode) WHERE b.componentId=z.componentId MERGE (z)<-[:IS_A]-(b) return count(*)\");\n",
    "\n",
    "db.cypher_query(\"\"\"\n",
    "MATCH (s:RelevantNode)-[v:VERB]->(o:RelevantNode)\n",
    "WITH s,v,o\n",
    "MATCH (e1:MergedNode {componentId:s.componentId}), (e2:MergedNode {componentId: o.componentId})\n",
    "with e1,v,e2\n",
    "MERGE (e1)-[:VERB2 {text: v.text, from: elementId(v)}]->(e2) RETURN *\"\"\");\n",
    "\n",
    "result, meta = db.cypher_query(\"\"\"MATCH (z:MergedNode) return DISTINCT z.componentId as componentId\"\"\")\n",
    "for cid in result:\n",
    "    cid = int(str(cid[0]))\n",
    "    texts = []\n",
    "    r_text, details = db.cypher_query(\"\"\"MATCH (z:RelevantNode {componentId: %s}) return z.text\"\"\"%cid)\n",
    "    for text in r_text:\n",
    "        texts.append(str(text)[1:-1]) # the weird 1:-1 is because of quoting done by neo4j\n",
    "    text = max(set(texts), key=texts.count)\n",
    "    db.cypher_query(\"\"\"MATCH (z:MergedNode {componentId: %s}) SET z.text = %s return *\"\"\"%(cid,text))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "77211f1a-ae67-4be9-b46f-cd4330fcf6b3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "pain interference               61\n",
       "outcome measures                45\n",
       "movement system                 41\n",
       "pain management                 30\n",
       "Cognitive-behavioral therapy    29\n",
       "                                ..\n",
       "secondary treatment              1\n",
       "sleep disturbance                1\n",
       "strategies to reduce pain        1\n",
       "reduces pain severity            1\n",
       "reducing pain intensity          1\n",
       "Name: count, Length: 374, dtype: int64"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "num, idc = db.cypher_query(\"\"\"MATCH (a:MergedNode) RETURN a.text\"\"\")\n",
    "pd.DataFrame(num).value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "51a02a7b-9d9e-4b4b-a796-bbae1979065d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.text</th>\n",
       "      <th>b.text</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>860</th>\n",
       "      <td>\"pain interference\"</td>\n",
       "      <td>\"Cognitive-behavioral therapy\"</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>\"Cognitive-behavioral therapy\"</td>\n",
       "      <td>\"pain interference\"</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2783</th>\n",
       "      <td>\"muscle activation\"</td>\n",
       "      <td>\"difficulty in performing daily activities\"</td>\n",
       "      <td>0.378923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2613</th>\n",
       "      <td>\"difficulty in performing daily activities\"</td>\n",
       "      <td>\"muscle activation\"</td>\n",
       "      <td>0.378923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>\"pain catastrophizing\"</td>\n",
       "      <td>\"cognitive process\"</td>\n",
       "      <td>0.296974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2713</th>\n",
       "      <td>\"Pain\"</td>\n",
       "      <td>\"emotional functioning\"</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2716</th>\n",
       "      <td>\"Pain\"</td>\n",
       "      <td>\"cognitive process\"</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2718</th>\n",
       "      <td>\"Pain\"</td>\n",
       "      <td>\"BIO treatment condition\"</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2722</th>\n",
       "      <td>\"Pain\"</td>\n",
       "      <td>\"Harm beliefs\"</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2702</th>\n",
       "      <td>\"Pain\"</td>\n",
       "      <td>\"post-treatment\"</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2231 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           a.text  \\\n",
       "860                           \"pain interference\"   \n",
       "97                 \"Cognitive-behavioral therapy\"   \n",
       "2783                          \"muscle activation\"   \n",
       "2613  \"difficulty in performing daily activities\"   \n",
       "50                         \"pain catastrophizing\"   \n",
       "...                                           ...   \n",
       "2713                                       \"Pain\"   \n",
       "2716                                       \"Pain\"   \n",
       "2718                                       \"Pain\"   \n",
       "2722                                       \"Pain\"   \n",
       "2702                                       \"Pain\"   \n",
       "\n",
       "                                           b.text     score  \n",
       "860                \"Cognitive-behavioral therapy\"  0.389871  \n",
       "97                            \"pain interference\"  0.389871  \n",
       "2783  \"difficulty in performing daily activities\"  0.378923  \n",
       "2613                          \"muscle activation\"  0.378923  \n",
       "50                            \"cognitive process\"  0.296974  \n",
       "...                                           ...       ...  \n",
       "2713                      \"emotional functioning\"  0.000000  \n",
       "2716                          \"cognitive process\"  0.000000  \n",
       "2718                    \"BIO treatment condition\"  0.000000  \n",
       "2722                               \"Harm beliefs\"  0.000000  \n",
       "2702                             \"post-treatment\"  0.000000  \n",
       "\n",
       "[2231 rows x 3 columns]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "link_pred = pd.read_csv('/home/myuser/Downloads/export.csv')\n",
    "link_pred.drop_duplicates().sort_values(by='score',ascending=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "807d42ea-a19b-4448-9d41-965894df9905",
   "metadata": {},
   "source": [
    "## Old code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 708,
   "id": "8b8c4fe5-276d-4b65-a9d7-f6b092093edc",
   "metadata": {},
   "outputs": [],
   "source": [
    "results, meta = db.cypher_query(\"match (a:RelevantNode) return DISTINCT a.text\")\n",
    "for r in results:\n",
    "    try:\n",
    "        text = r[0].strip()\n",
    "        if len(text.strip()) > 2:\n",
    "            embedding = get_embedding(text.strip())\n",
    "            params = {\"text\": text, \"embedding\": embedding.numpy()}\n",
    "            db.cypher_query(\"MATCH (a:RelevantNode) WHERE a.text = $text SET a.embedding = $embedding RETURN a\", params=params)\n",
    "        else:\n",
    "            print(\"please no\")\n",
    "            embedding = get_embedding(\"THIS IS AN ERROR\")\n",
    "            params = {\"text\": text, \"embedding\": embedding.numpy()}\n",
    "            db.cypher_query(\"MATCH (a:RelevantNode) WHERE a.text = $text SET a.embedding = $embedding RETURN a\", params=params)\n",
    "    except Exception as e:\n",
    "        print(f\"Not handling this right now: {e}.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 709,
   "id": "91b31dc9-a48a-43a6-9979-e4f18f519cdd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], [])"
      ]
     },
     "execution_count": 709,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\"\"\"DROP INDEX `text-embeddings`\"\"\")\n",
    "db.cypher_query(\"CALL db.index.vector.createNodeIndex('text-embeddings', 'RelevantNode', 'embedding', 768, 'cosine')\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 710,
   "id": "ea3ceb5b-b58e-440e-8c0e-73436685efe4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "290\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "7"
      ]
     },
     "execution_count": 710,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sim_threshold = 0.9\n",
    "sim_results, sim_meta = db.cypher_query(\"MATCH (z:RelevantNode) RETURN DISTINCT z.text\")\n",
    "print(len(sim_results))\n",
    "errors = []\n",
    "error_msgs = []\n",
    "for r in sim_results:\n",
    "    if len(str(r).strip()) > 2:\n",
    "        # 1200 is used as the node size as a way to compare against all nodes (~1100 relevant nodes)\n",
    "        sim_cypher = \"\"\"\n",
    "    MATCH (s:RelevantNode {text: '%s'})\n",
    "    CALL db.index.vector.queryNodes('text-embeddings', 1200, s.embedding)\n",
    "    YIELD node AS similar, score\n",
    "    WHERE score >= %s and elementId(s) < elementId(similar)\n",
    "    MERGE (s)-[:COSINE_SIM {score: score}]-(similar)\n",
    "    return *\n",
    "        \"\"\"%(str(r[0]).strip().replace(\"'\", \"\"),sim_threshold)\n",
    "        try:\n",
    "            db.cypher_query(sim_cypher)\n",
    "        except Exception as e:\n",
    "            errors.append(r[0])\n",
    "            error_msgs.append(e)\n",
    "            #import pdb; pdb.set_trace()\n",
    "len(errors)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 758,
   "id": "d2f44331-2ce7-4ca9-b495-486645becdac",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "neo4j.exceptions.ClientError('Failed to invoke procedure `db.index.vector.queryNodes`: Caused by: java.lang.UnsupportedOperationException: Query not supported: [PropertyIndexQuery.NearestNeighborsPredicate[k=1200,query={-0.008041561,0.00834628,-0.06169735,0.0047097746,-0.019002378,-0.029322127,-0.010342332,0.045739442,-0.032844268,0.008141614,0.0030918336,0.042764418,-0.035775505,0.0076471665,0.0017682989,0.01564649,-0.04052125,-0.01084318,0.018961333,-0.010938599,0.010701618,-0.004017645,-0.028634673,-0.021335375,0.030338898,0.056767013,-0.013404507,0.008656983,-0.019208463,0.029388636,-0.011504103,0.02279363,-0.04453791,-0.02342327,0.0074887914,0.016450996,-7.8078423E-4,-0.027690135,-0.005047781,0.005823039,0.011081208,0.01902879,0.033426918,-0.0031959384,0.029234394,-0.029880991,0.0043422305,0.050432045,0.011244113,-0.02810885,-0.04895739,0.023479108,0.022124926,0.04646592,0.010060591,-0.01785056,-0.016443301,-0.019382635,-0.016624074,-0.00954127,-0.017120382,0.0498875,-0.023224745,0.053730547,-0.023778226,-0.020489607,0.03475852,-0.0067604803,0.024624625,0.029462213,0.051732063,-0.013640225,0.03070047,0.029231446,0.02726673,-0.04248068,0.011340606,-0.014038379,-0.039578777,-0.009808306,0.011951562,-0.014600312,-0.02505649,-0.02315743,0.03500119,0.03074341,-0.008078144,-0.008142098,-0.0081647625,0.04331753,0.057488304,0.019996256,-0.019540478,0.022013707,0.021057358,-0.028484477,0.0020755825,0.012275484,-0.012306349,0.011264449,-0.023262037,-0.003116045,0.010520686,0.030329682,-0.014985369,-0.0154769095,0.022017973,-0.06338868,-0.005102729,0.0051191547,0.049949553,-0.06317482,-0.034440786,-0.031429943,-0.013458033,0.027185965,-0.06386476,-0.0137000475,-0.05710926,0.062934235,-0.025706774,-0.04761827,0.004785297,-0.03407674,0.0047916295,0.010530203,0.015633695,-0.025563344,0.05223842,-0.04172545,-0.04177827,-0.018028634,0.023850644,-0.017410463,-0.02056483,0.025990376,-0.025955612,-0.0042462056,-0.017205436,-0.043670237,-0.0077812527,0.022318853,0.03534382,0.041435927,0.0064386167,0.033447605,-0.019784944,-0.020898525,-0.024848472,-0.011895128,-0.041017044,0.014149738,-0.0016960182,0.04909401,0.0179286,-0.022393089,0.037393775,-0.008341115,-0.009586028,0.011190998,0.0027665463,-0.012986424,0.054187227,-0.015190347,0.004298379,0.003426364,-5.805323E-4,0.0152603015,-0.027160224,-0.03529865,-0.0019553571,0.023634905,0.04353142,0.035578936,0.02678712,-0.0473609,-0.020372622,0.017383501,-0.009055315,0.036352612,-0.022443974,0.012904543,-0.0139409825,0.0094728395,0.03404244,-0.031843252,-0.012661477,0.013769508,0.022402331,0.029358702,0.030598616,0.0019872617,0.032876406,-0.013493284,-9.575379E-4,6.493195E-4,-0.055390213,-0.0213714,-0.017610038,0.010089961,-0.056868132,0.012737534,-0.025788656,0.018014321,-0.029594444,0.019547684,-0.0051517105,-0.07488601,0.030180687,-0.012647733,-0.008191285,-0.022745134,0.022684524,-0.009963806,-0.029403113,0.0080950875,0.030609302,0.016892215,0.010964029,-0.016359324,0.016077977,0.0024720787,-0.002160339,0.020306787,-0.023025908,0.041747354,-0.0025399488,0.028195597,-0.0022660303,-0.04453555,0.04385934,0.033979405,-0.01690146,0.025752842,0.026308095,-0.008163562,-0.01834255,0.03965315,0.028068274,-0.04386729,-0.017462457,0.02552911,0.012561437,-0.0057958676,0.002666054,-0.06770196,-0.018184463,0.034284044,0.031856943,0.020311015,0.031206103,0.052518465,-0.04288175,0.006650823,-0.012288964,0.02178233,0.012628264,-0.015556355,0.016861739,-0.01466789,0.023785248,-0.03262783,0.0033462709,0.019919816,0.007606912,-0.04818353,0.009131908,0.032835733,0.012277915,0.016331533,-0.02730259,-0.037212584,-0.014517405,-0.035905596,-0.016865155,0.02964064,0.0117090475,-0.030191373,-0.021064889,-0.033662476,-0.0052977074,0.04176702,0.03893717,0.12925126,-0.031344526,-0.023768563,-0.03550958,-0.027232584,-0.0034045002,-0.021278335,0.03924045,-0.035937805,-0.005178291,0.030881187,-0.022983467,-0.0317647,-0.0066643916,0.031564537,0.017227668,-0.041361418,0.010644403,-0.02964194,-0.038338814,-0.052814376,-0.003597779,-0.046554018,0.03943071,-0.025938137,0.013067152,0.015782837,0.020909654,-0.04357878,0.058927815,0.006234208,0.028479682,-0.041407667,-0.009389192,-0.012139295,-0.042758152,0.004987573,0.01661345,-0.045779325,-0.032327425,-0.017248772,0.006861427,0.013234433,0.04168748,-0.010790225,-0.024455426,0.015400345,0.0031470777,0.016231827,0.0025467132,0.0041697696,0.015531217,3.6501652E-4,0.012406173,-0.004017192,0.013338194,-0.028230326,-0.07111435,0.023603527,0.01590599,0.025712,0.018996516,0.014298142,0.008933409,-0.027531441,-0.017701982,0.061491486,-0.021214264,-0.006382402,-0.011912603,4.3834207E-4,-0.013323981,-0.028689407,-0.040121075,-0.059570946,0.030526347,0.022278626,-0.062016416,2.536164E-4,0.013943669,-0.041227393,0.037081547,0.036579657,0.0545513,9.7622373E-4,0.010824237,-0.02082767,-0.015668897,0.019411856,0.029739872,-0.011015818,0.045320693,0.017978372,0.054442976,-0.058122233,-0.02452036,0.061208107,0.05045006,0.02038021,-0.0073168334,-0.0073371674,0.007170782,0.026541043,0.033892203,0.047811102,-0.021415662,0.04809498,0.013941674,-0.035400584,-0.021525403,0.030006364,0.03276153,-0.01420635,0.04661001,0.048246652,0.0040011965,0.026781244,0.02781281,0.031324636,-0.0032635943,-0.025477959,-0.03129758,-0.023317724,0.014131429,0.070325166,0.047031455,0.031334344,0.03859033,-0.03947754,-0.037534304,0.0039585093,-0.021654336,-0.057685453,0.032266777,0.08976536,0.059979897,-0.022657394,-0.028236214,0.01731199,0.5891313,0.016060073,-0.048352033,0.02240305,-0.005854153,-0.046828806,0.04053301,-0.0095563205,-0.014939667,0.031207459,-0.014202355,0.03533238,-0.00820909,0.0775151,0.054144472,-0.03728238,-0.012924899,0.046116967,-0.01635643,0.010074664,-0.011021033,0.009792418,-0.009654407,0.006001715,0.027847886,0.0057009915,-0.03639596,-0.015797554,-0.028599543,-0.03843091,-0.01231661,-0.03932872,0.02294559,-0.009460244,0.028331753,-0.004348023,0.047836617,0.014148328,-0.019489272,-0.04357721,0.025982503,-0.03611319,0.0065316684,-0.029523263,-0.031513363,0.041156735,0.020355217,0.0013780158,-0.02999772,-0.011176376,0.0020354858,0.012921636,-0.027548786,-0.023903742,-0.02471808,0.02156986,0.010407755,-0.017923625,0.0065661515,0.016419899,0.001782036,0.00598273,0.008924647,0.008070528,0.014187255,0.032735866,0.023212014,0.004133024,0.035680223,0.0024998619,-0.009990907,-0.023298398,-0.005377698,0.013849926,-0.03698645,0.009142922,-0.033351,0.0124013005,-0.0025639713,-0.03751921,-0.008662416,0.004584706,0.0057472643,-0.024292536,-0.025236841,-0.03772621,-0.02865118,-0.009945501,-0.004829878,0.0017692583,0.011417484,0.03376041,0.0031467306,-0.032399125,-0.046474822,0.04769294,0.010509976,-0.03159546,0.014029838,0.011594507,0.021173945,0.009165825,0.031020578,-0.017051913,-0.03310416,-0.016147865,-0.05063128,0.059607018,-0.014195805,-0.009685079,0.028356424,-0.024951216,-0.08414697,0.017988158,0.0029636833,-0.0072046192,-0.020417707,0.0051088883,3.139304E-4,-0.047831893,0.053794853,-0.012797294,0.045342732,0.017922908,0.014593966,0.003326713,-0.008413786,-0.008910268,-0.0074669104,-0.0108631,-0.008132014,-0.012452322,-0.011874534,0.034970433,0.012007808,0.010836161,-0.016916007,0.03258082,0.048521206,0.0059236055,0.0069899177,-0.039217547,-0.009072096,-6.059785E-4,0.029681738,0.014943888,-0.011831432,0.034614954,0.026731523,0.011502766,0.045097467,-0.039134618,-0.004872103,0.010156672,0.0074825194,0.023908652,-0.06634679,-0.04734761,0.028407212,0.009586077,0.0036297839,-0.01922803,-0.010833165,-0.018632652,0.032399323,-0.01912584,-0.035496857,-0.016029907,-0.01155893,-0.017599091,-0.04310457,0.023563657,-0.019998275,-0.0036819894,-0.028397711,0.0061837146,0.018754162,0.021448834,-0.013360725,-0.041216224,-0.030556798,0.009620736,-0.01938529,0.0459517,0.05778103,-0.0060993126,-0.042275578,0.0032024407,-0.031646177,0.026121624,0.020329,-0.037044115,-0.036963716,0.0069715627,0.005448912,-0.025840025,-0.047073614,-0.01379207,-0.033465505,-0.0017317957,0.017407523,-0.054546893,0.06842706,-0.0048704995,-0.028546263,0.02878423,-0.024939261,0.025939217,0.0014262045,-0.0064017694,-0.011942556,-0.030019917,0.023634743,-0.039698374,-0.042551454,-0.014042909,-0.073660836,0.008936214,-0.0035814191,-0.009724438,-0.014313684,-0.0580253,-0.078626625,0.030731568,0.039291956,0.014411449,-0.0012727795,-0.030880798,0.037788726,-0.03669747,0.036057107,-0.01791054,-0.009803203,0.03877038,-0.064379886,0.014590956,-0.020233488,0.03215734,-0.0023926785,0.0037485408,0.06568674,0.0013262428,0.014108725,-0.004511924,0.021421898,0.009891408,0.02629406,-0.013351442,-0.006352006,-0.022552283,0.00928459,0.018599816,0.0064368183,6.6027645E-4,-0.024727706,-0.014462216,-0.030665707,-0.038849525,-0.010675481,-0.004708641,-0.030052261,0.024794636,0.008032157,-6.9283356E-4,0.04373218,0.029791193,0.041629642,-0.0146122305,0.031190876,-0.053669207,0.020712493,-0.0061029955,0.05360577,-0.004430021,0.026822867,-0.016840601,-0.008835168,0.012968086,0.033386704,-0.019017482,0.010933018,-0.0019695463,0.025246646,0.004195253,0.020530097,-0.061492335,0.010538633,-0.00833345,-0.025709553,-0.032826863,0.049111363,-0.016500525,0.0029160746,-0.017667547,-0.011527474,-0.012621811,-0.020665139,0.015205772,0.034695927,-0.0023653554,-0.06081821,-0.0071991105,-0.06842809,0.01291529,-0.01065167,0.043282412,0.016987754,-0.06516146,0.018714841,0.028533038,0.0013239718,0.0015994507,-0.027714087,0.045349248,0.028315771,0.007628714,0.007044721,0.024010167,-0.011938221,-0.004035103,0.00865879,-0.06530891,-0.024907673,0.06343547,0.016717397,0.008016923,-0.010531676,-0.02473481,-0.02271758,0.0023612934,0.04314397,-0.024355602,0.0050463025,0.03506896,0.017758787,-0.010226983,-0.012907915,-0.015434358,0.006527037,-0.039028335,-0.03068198,0.004392089,-0.022476286,-0.034297753,-0.02462792,-0.07897201},propertyKeyId=-1]]')"
      ]
     },
     "execution_count": 758,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "error_msgs[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 711,
   "id": "1ac9a78b-16f1-4a72-be9b-caae03d3996c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# try:\n",
    "#     db.cypher_query(\"CALL gds.graph.drop('myGraph') YIELD graphName;\")\n",
    "# except:\n",
    "#     pass # graph exists\n",
    "\n",
    "# db.cypher_query(\n",
    "#     \"\"\"\n",
    "# CALL gds.graph.project(\n",
    "#   'myGraph',\n",
    "#   'RelevantNode',\n",
    "#   'COSINE_SIM',\n",
    "#   {\n",
    "#   }\n",
    "# )\n",
    "#     \"\"\"\n",
    "# )\n",
    "# db.cypher_query(\"\"\"\n",
    "# CALL gds.wcc.stream('myGraph')\n",
    "# YIELD componentId, nodeId\n",
    "# WITH gds.util.asNode(nodeId) AS n, componentId AS componentId\n",
    "# SET n.componentId=componentId\n",
    "# RETURN n\n",
    "# \"\"\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 712,
   "id": "0b550e50-f3fe-4dc5-bdaf-5e55de2b1f6b",
   "metadata": {},
   "outputs": [],
   "source": [
    "try:\n",
    "    db.cypher_query(\"CALL gds.graph.drop('testGraph') YIELD graphName;\")\n",
    "except:\n",
    "    pass # graph exists\n",
    "\n",
    "# test graph\n",
    "db.cypher_query(\n",
    "    \"\"\"\n",
    "CALL gds.graph.project(\n",
    "  'testGraph',\n",
    "  {RelevantNode: {properties: 'embedding'}},\n",
    "  'COSINE_SIM',\n",
    "  {\n",
    "  }\n",
    ")\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "db.cypher_query(\"\"\"\n",
    "CALL gds.kmeans.stream('testGraph', {nodeProperty: 'embedding', k: 36, randomSeed: 42})\n",
    "YIELD communityId, nodeId\n",
    "WITH gds.util.asNode(nodeId) AS n, communityId AS componentId\n",
    "SET n.componentId=componentId\n",
    "RETURN n\n",
    "\"\"\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 713,
   "id": "bbab0238-298a-4442-bee6-128251c3fd78",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.cypher_query(\"\"\"\n",
    "MATCH (z:RelevantNode) with COUNT(z.componentId) as c, z.componentId as componentId\n",
    "MERGE (b:MergedNode {componentId: componentId})\n",
    "return count(*)\n",
    "\"\"\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 714,
   "id": "b06db02f-dc19-4c29-81f0-82634be20226",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.cypher_query(\"MATCH (z:MergedNode), (b:RelevantNode) WHERE b.componentId=z.componentId MERGE (z)<-[:IS_A]-(b) return count(*)\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 715,
   "id": "967ce0b6-7e3f-4da3-b5b7-63da19d10500",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.cypher_query(\"\"\"\n",
    "MATCH (s:RelevantNode)-[v:VERB]->(o:RelevantNode)\n",
    "WITH s,v,o\n",
    "MATCH (e1:MergedNode {componentId:s.componentId}), (e2:MergedNode {componentId: o.componentId})\n",
    "with e1,v,e2\n",
    "MERGE (e1)-[:VERB2 {text: v.text, from: elementId(v)}]->(e2) RETURN *\"\"\");"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 716,
   "id": "4e9f783f-fdff-4893-b2c8-fac157cf7046",
   "metadata": {},
   "outputs": [],
   "source": [
    "result, meta = db.cypher_query(\"\"\"MATCH (z:MergedNode) return DISTINCT z.componentId as componentId\"\"\")\n",
    "for cid in result:\n",
    "    cid = int(str(cid[0]))\n",
    "    texts = []\n",
    "    r_text, details = db.cypher_query(\"\"\"MATCH (z:RelevantNode {componentId: %s}) return z.text\"\"\"%cid)\n",
    "    for text in r_text:\n",
    "        texts.append(str(text)[1:-1]) # the weird 1:-1 is because of quoting done by neo4j\n",
    "    text = max(set(texts), key=texts.count)\n",
    "    db.cypher_query(\"\"\"MATCH (z:MergedNode {componentId: %s}) SET z.text = %s return *\"\"\"%(cid,text))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 717,
   "id": "23d162ff-4ef9-4601-a451-39851a85523c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Acceptance- and mindfulness-based interventions for chronic pain    1\n",
       "Behavioral therapy                                                  1\n",
       "Behavioral-therapy                                                  1\n",
       "Cognitive Behaviour Therapy                                         1\n",
       "Cognitive behavioral therapy                                        1\n",
       "Cognitive therapy                                                   1\n",
       "Cognitive-behavioral interventions                                  1\n",
       "Cognitive-behavioral therapies                                      1\n",
       "Cognitive-behavioral therapy                                        1\n",
       "Emotion-focused coping                                              1\n",
       "Hypnotic Cognitive Therapy                                          1\n",
       "Mindfulness-Based Stress Reduction                                  1\n",
       "Mindfulness-based theory                                            1\n",
       "Pain Intensity ratings                                              1\n",
       "active treatments                                                   1\n",
       "behavioral treatment                                                1\n",
       "cognitive behavioral treatment                                      1\n",
       "cognitive-behavioral treatment                                      1\n",
       "mindfulness-based interventions                                     1\n",
       "movement system                                                     1\n",
       "movement variability                                                1\n",
       "outcome assessment                                                  1\n",
       "outcome measure                                                     1\n",
       "outcome measures                                                    1\n",
       "outcome mediators                                                   1\n",
       "outcome variables                                                   1\n",
       "pain coping skill                                                   1\n",
       "pain interference                                                   1\n",
       "pain management                                                     1\n",
       "pain treatments                                                     1\n",
       "pain-interference                                                   1\n",
       "primary outcome measure                                             1\n",
       "psychological treatment                                             1\n",
       "treatment mechanisms                                                1\n",
       "Name: count, dtype: int64"
      ]
     },
     "execution_count": 717,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "num, idc = db.cypher_query(\"\"\"MATCH (a:MergedNode) RETURN a.text\"\"\")\n",
    "pd.DataFrame(num).value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 718,
   "id": "e2599367-7767-4e28-98ee-ae8ca0257825",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Mindfulness-based stress reduction</td>\n",
       "      <td>instance of</td>\n",
       "      <td>treatment option</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Posttreatment cognitive-behavioral therapy</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>cognitive-behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Posttreatment cognitive-behavioral therapy</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>cognitive-behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Behavioral-therapy</td>\n",
       "      <td>has part</td>\n",
       "      <td>behavioral-therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>behavioral-therapy</td>\n",
       "      <td>part of</td>\n",
       "      <td>Behavioral-therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based stress reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Mindfulness-based interventions</td>\n",
       "      <td>different from</td>\n",
       "      <td>cognitive behavioral treatments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Mindfulness-based Pain Management</td>\n",
       "      <td>use</td>\n",
       "      <td>Pain Management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Four Step Mindfulness-based Therapy</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Mindfulness-based Pain Management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Acceptance- and mindfulness-based interventions</td>\n",
       "      <td>different from</td>\n",
       "      <td>pain control and reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>cognitive appraisal</td>\n",
       "      <td>used by</td>\n",
       "      <td>cognitive behavioural therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>active treatment</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>psychological treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Mindfulness-based stress reduction</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Mindfulness-based stress reduction</td>\n",
       "      <td>medical condition treated</td>\n",
       "      <td>pain conditions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Mindfulness-based stress reduction</td>\n",
       "      <td>medical condition treated</td>\n",
       "      <td>pain conditions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Mindfulness-Based Cognitive Therapy</td>\n",
       "      <td>main subject</td>\n",
       "      <td>mindfulness-based cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Cognitive restructuring</td>\n",
       "      <td>part of</td>\n",
       "      <td>cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Pain interference</td>\n",
       "      <td>instance of</td>\n",
       "      <td>outcome variables</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Pain willingness</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>outcome mediators</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Hypnotic Cognitive Therapy</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Cognitive Therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Hypnotic Cognitive Therapy</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Cognitive Therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Cognitive Therapy intervention</td>\n",
       "      <td>instance of</td>\n",
       "      <td>treatment protocols</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>active treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>differential treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>has effect</td>\n",
       "      <td>reduces pain severity</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Cognitive behavioral therapy</td>\n",
       "      <td>use</td>\n",
       "      <td>pain management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Cognitive behavioral therapy</td>\n",
       "      <td>use</td>\n",
       "      <td>pain management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Cognitive behavioral therapy</td>\n",
       "      <td>use</td>\n",
       "      <td>pain management</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    0  \\\n",
       "0                  Mindfulness-based stress reduction   \n",
       "1          Posttreatment cognitive-behavioral therapy   \n",
       "2          Posttreatment cognitive-behavioral therapy   \n",
       "3                                  Behavioral-therapy   \n",
       "4                                  behavioral-therapy   \n",
       "5   Acceptance- and mindfulness-based intervention...   \n",
       "6   Acceptance- and mindfulness-based intervention...   \n",
       "7                     Mindfulness-based interventions   \n",
       "8                   Mindfulness-based Pain Management   \n",
       "9                 Four Step Mindfulness-based Therapy   \n",
       "10    Acceptance- and mindfulness-based interventions   \n",
       "11                                cognitive appraisal   \n",
       "12                                   active treatment   \n",
       "13                 Mindfulness-based stress reduction   \n",
       "14                 Mindfulness-based stress reduction   \n",
       "15                 Mindfulness-based stress reduction   \n",
       "16                Mindfulness-Based Cognitive Therapy   \n",
       "17                            Cognitive restructuring   \n",
       "18                                  Pain interference   \n",
       "19                                   Pain willingness   \n",
       "20                         Hypnotic Cognitive Therapy   \n",
       "21                         Hypnotic Cognitive Therapy   \n",
       "22                     Cognitive Therapy intervention   \n",
       "23                                   active treatment   \n",
       "24                       Cognitive-behavioral therapy   \n",
       "25                       Cognitive behavioral therapy   \n",
       "26                       Cognitive behavioral therapy   \n",
       "27                       Cognitive behavioral therapy   \n",
       "\n",
       "                            1                                    2  \n",
       "0                 instance of                     treatment option  \n",
       "1                 subclass of         cognitive-behavioral therapy  \n",
       "2                 subclass of         cognitive-behavioral therapy  \n",
       "3                    has part                   behavioral-therapy  \n",
       "4                     part of                   Behavioral-therapy  \n",
       "5                    has part   mindfulness-based stress reduction  \n",
       "6                    has part  mindfulness-based cognitive therapy  \n",
       "7              different from      cognitive behavioral treatments  \n",
       "8                         use                      Pain Management  \n",
       "9                 subclass of    Mindfulness-based Pain Management  \n",
       "10             different from           pain control and reduction  \n",
       "11                    used by        cognitive behavioural therapy  \n",
       "12                subclass of              psychological treatment  \n",
       "13                subclass of                    cognitive therapy  \n",
       "14  medical condition treated                      pain conditions  \n",
       "15  medical condition treated                      pain conditions  \n",
       "16               main subject  mindfulness-based cognitive therapy  \n",
       "17                    part of                    cognitive therapy  \n",
       "18                instance of                    outcome variables  \n",
       "19                subclass of                    outcome mediators  \n",
       "20                subclass of                    Cognitive Therapy  \n",
       "21                subclass of                    Cognitive Therapy  \n",
       "22                instance of                  treatment protocols  \n",
       "23                    part of               differential treatment  \n",
       "24                 has effect                reduces pain severity  \n",
       "25                        use                      pain management  \n",
       "26                        use                      pain management  \n",
       "27                        use                      pain management  "
      ]
     },
     "execution_count": 718,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "num, idc = db.cypher_query(\"\"\"MATCH (a:RelevantNode)-[r:VERB]->(b:RelevantNode) RETURN a.text, r.text, b.text\"\"\")\n",
    "pd.DataFrame(num)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 719,
   "id": "67bf0324-8448-4c78-9f6a-7cc7bf9a8cf9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>has effect</td>\n",
       "      <td>pain coping skill</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Cognitive therapy</td>\n",
       "      <td>instance of</td>\n",
       "      <td>treatment mechanisms</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>active treatments</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>psychological treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>active treatments</td>\n",
       "      <td>part of</td>\n",
       "      <td>active treatments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Cognitive behavioral therapy</td>\n",
       "      <td>use</td>\n",
       "      <td>pain management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>pain coping skill</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>outcome mediators</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>psychological treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>Cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>psychological treatment</td>\n",
       "      <td>used by</td>\n",
       "      <td>Cognitive Behaviour Therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "      <td>instance of</td>\n",
       "      <td>treatment mechanisms</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "      <td>medical condition treated</td>\n",
       "      <td>pain treatments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "      <td>use</td>\n",
       "      <td>pain management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "      <td>main subject</td>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>pain interference</td>\n",
       "      <td>instance of</td>\n",
       "      <td>outcome variables</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>cognitive-behavioral treatment</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Behavioral-therapy</td>\n",
       "      <td>part of</td>\n",
       "      <td>Behavioral-therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Behavioral-therapy</td>\n",
       "      <td>has part</td>\n",
       "      <td>Behavioral-therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>different from</td>\n",
       "      <td>pain coping skill</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>mindfulness-based interventions</td>\n",
       "      <td>different from</td>\n",
       "      <td>cognitive behavioral treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Mindfulness-based theory</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Hypnotic Cognitive Therapy</td>\n",
       "      <td>subclass of</td>\n",
       "      <td>Cognitive therapy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    0  \\\n",
       "0                        Cognitive-behavioral therapy   \n",
       "1                                   Cognitive therapy   \n",
       "2                                   active treatments   \n",
       "3                                   active treatments   \n",
       "4                        Cognitive behavioral therapy   \n",
       "7                                   pain coping skill   \n",
       "8                             psychological treatment   \n",
       "9                             psychological treatment   \n",
       "10                 Mindfulness-Based Stress Reduction   \n",
       "11                 Mindfulness-Based Stress Reduction   \n",
       "12                 Mindfulness-Based Stress Reduction   \n",
       "14                 Mindfulness-Based Stress Reduction   \n",
       "15                 Mindfulness-Based Stress Reduction   \n",
       "16                                  pain interference   \n",
       "17                     cognitive-behavioral treatment   \n",
       "19                                 Behavioral-therapy   \n",
       "20                                 Behavioral-therapy   \n",
       "21  Acceptance- and mindfulness-based intervention...   \n",
       "22  Acceptance- and mindfulness-based intervention...   \n",
       "24                    mindfulness-based interventions   \n",
       "25                           Mindfulness-based theory   \n",
       "26                         Hypnotic Cognitive Therapy   \n",
       "\n",
       "                            1                                   2  \n",
       "0                  has effect                   pain coping skill  \n",
       "1                 instance of                treatment mechanisms  \n",
       "2                 subclass of             psychological treatment  \n",
       "3                     part of                   active treatments  \n",
       "4                         use                     pain management  \n",
       "7                 subclass of                   outcome mediators  \n",
       "8                     part of                   Cognitive therapy  \n",
       "9                     used by         Cognitive Behaviour Therapy  \n",
       "10                instance of                treatment mechanisms  \n",
       "11                subclass of                   Cognitive therapy  \n",
       "12  medical condition treated                     pain treatments  \n",
       "14                        use                     pain management  \n",
       "15               main subject  Mindfulness-Based Stress Reduction  \n",
       "16                instance of                   outcome variables  \n",
       "17                subclass of        Cognitive-behavioral therapy  \n",
       "19                    part of                  Behavioral-therapy  \n",
       "20                   has part                  Behavioral-therapy  \n",
       "21                   has part  Mindfulness-Based Stress Reduction  \n",
       "22             different from                   pain coping skill  \n",
       "24             different from      cognitive behavioral treatment  \n",
       "25                subclass of  Mindfulness-Based Stress Reduction  \n",
       "26                subclass of                   Cognitive therapy  "
      ]
     },
     "execution_count": 719,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "num, idc = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2]->(b:MergedNode) RETURN a.text, r.text, b.text\"\"\")\n",
    "pd.DataFrame(num).drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 720,
   "id": "06ffc3fb-e8b4-4d70-bb92-1e60d8db7f49",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Cognitive therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>active treatments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Cognitive behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>pain management</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Pain Intensity ratings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>outcome measures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>pain coping skill</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>psychological treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>outcome measure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>treatment mechanisms</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Mindfulness-Based Stress Reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>pain interference</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>outcome variables</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Cognitive-behavioral therapies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Emotion-focused coping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>cognitive behavioral treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>behavioral treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>outcome assessment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>cognitive-behavioral treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Behavioral-therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Cognitive-behavioral interventions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>mindfulness-based interventions</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Mindfulness-based theory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>pain-interference</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>primary outcome measure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Cognitive Behaviour Therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Hypnotic Cognitive Therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>movement variability</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>pain treatments</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>outcome mediators</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>movement system</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    0\n",
       "0                        Cognitive-behavioral therapy\n",
       "1                                   Cognitive therapy\n",
       "2                                   active treatments\n",
       "3                        Cognitive behavioral therapy\n",
       "4                                     pain management\n",
       "5                              Pain Intensity ratings\n",
       "6                                    outcome measures\n",
       "7                                   pain coping skill\n",
       "8                             psychological treatment\n",
       "9                                     outcome measure\n",
       "10                               treatment mechanisms\n",
       "11                                 Behavioral therapy\n",
       "12                 Mindfulness-Based Stress Reduction\n",
       "13                                  pain interference\n",
       "14                                  outcome variables\n",
       "15                     Cognitive-behavioral therapies\n",
       "16                             Emotion-focused coping\n",
       "17                     cognitive behavioral treatment\n",
       "18                               behavioral treatment\n",
       "19                                 outcome assessment\n",
       "20                     cognitive-behavioral treatment\n",
       "21                                 Behavioral-therapy\n",
       "22                 Cognitive-behavioral interventions\n",
       "23  Acceptance- and mindfulness-based intervention...\n",
       "24                    mindfulness-based interventions\n",
       "25                           Mindfulness-based theory\n",
       "26                                  pain-interference\n",
       "27                            primary outcome measure\n",
       "28                        Cognitive Behaviour Therapy\n",
       "29                         Hypnotic Cognitive Therapy\n",
       "30                               movement variability\n",
       "31                                    pain treatments\n",
       "32                                  outcome mediators\n",
       "33                                    movement system"
      ]
     },
     "execution_count": 720,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "num, idc = db.cypher_query(\"\"\"MATCH (a:MergedNode) RETURN a.text\"\"\")\n",
    "pd.DataFrame(num)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 721,
   "id": "7c25b922-a8d9-46c7-9d71-a30608b08b87",
   "metadata": {},
   "outputs": [],
   "source": [
    "manual_nodes = [\"Mindfulness-based stress reduction\",\n",
    "                \"Treatment option\",\n",
    "                \"Posttreatment cognitive-behavioral therapy\",\n",
    "                \"cognitive behavioral therapy\",\n",
    "                \"behavioral therapy\",\n",
    "                \"Mindfulness-based interventions\",\n",
    "                \"Mindfulness-based Pain Management\",\n",
    "                \"Pain Management\"]\n",
    "merged_nodes = pd.DataFrame()\n",
    "query = \"\"\"\n",
    "MATCH (s:RelevantNode {text: $text})-[IS_A]->(o:MergedNode)\n",
    "RETURN s.text, o.text\"\"\"\n",
    "for node in manual_nodes:\n",
    "    params = {\"text\": node}\n",
    "    out, ign = db.cypher_query(query, params)\n",
    "    merged_nodes = pd.concat([merged_nodes, pd.DataFrame(out)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 722,
   "id": "6ae953cb-89ed-470d-b408-16b1b7d44c8b",
   "metadata": {},
   "outputs": [],
   "source": [
    "hout, ign = db.cypher_query(\"Match (a:Hypothesis)<-[:FROM]-(b:Entity)<-[r2:ANNOTATES]-(c:Class)-[r1:ANNOTATES]->(d:RelevantNode)-[r3:VERB]->(e:RelevantNode) Return a.name, b.text, c.text, d.text, r3.text, e.text\")\n",
    "debugging = pd.DataFrame(hout)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 723,
   "id": "569ead75-bf58-4975-962a-7793b0640365",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>h2</td>\n",
       "      <td>pain-free controls</td>\n",
       "      <td>How Much Distress Pain</td>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based stress reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>h2</td>\n",
       "      <td>pain anticipation</td>\n",
       "      <td>How Much Distress Pain</td>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based stress reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>h2</td>\n",
       "      <td>pain anticipation</td>\n",
       "      <td>Pain, CTCAE</td>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based stress reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>h2</td>\n",
       "      <td>pain-free controls</td>\n",
       "      <td>Pain, CTCAE</td>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based stress reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>h2</td>\n",
       "      <td>pain anticipation</td>\n",
       "      <td>Pain Distress</td>\n",
       "      <td>Acceptance- and mindfulness-based intervention...</td>\n",
       "      <td>has part</td>\n",
       "      <td>mindfulness-based stress reduction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>239</th>\n",
       "      <td>h2</td>\n",
       "      <td>active rehabilitation</td>\n",
       "      <td>Active Study</td>\n",
       "      <td>active treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>differential treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>240</th>\n",
       "      <td>h2</td>\n",
       "      <td>active rehabilitation</td>\n",
       "      <td>Active License</td>\n",
       "      <td>active treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>differential treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>242</th>\n",
       "      <td>h2</td>\n",
       "      <td>active rehabilitation</td>\n",
       "      <td>Active</td>\n",
       "      <td>active treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>differential treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>244</th>\n",
       "      <td>h2</td>\n",
       "      <td>active rehabilitation</td>\n",
       "      <td>Pet is as Active as it Has Been</td>\n",
       "      <td>active treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>differential treatment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>245</th>\n",
       "      <td>h2</td>\n",
       "      <td>active rehabilitation</td>\n",
       "      <td>Active Control</td>\n",
       "      <td>active treatment</td>\n",
       "      <td>part of</td>\n",
       "      <td>differential treatment</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>92 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      0                      1                                2  \\\n",
       "37   h2     pain-free controls           How Much Distress Pain   \n",
       "38   h2      pain anticipation           How Much Distress Pain   \n",
       "39   h2      pain anticipation                      Pain, CTCAE   \n",
       "40   h2     pain-free controls                      Pain, CTCAE   \n",
       "42   h2      pain anticipation                    Pain Distress   \n",
       "..   ..                    ...                              ...   \n",
       "239  h2  active rehabilitation                     Active Study   \n",
       "240  h2  active rehabilitation                   Active License   \n",
       "242  h2  active rehabilitation                           Active   \n",
       "244  h2  active rehabilitation  Pet is as Active as it Has Been   \n",
       "245  h2  active rehabilitation                   Active Control   \n",
       "\n",
       "                                                     3         4  \\\n",
       "37   Acceptance- and mindfulness-based intervention...  has part   \n",
       "38   Acceptance- and mindfulness-based intervention...  has part   \n",
       "39   Acceptance- and mindfulness-based intervention...  has part   \n",
       "40   Acceptance- and mindfulness-based intervention...  has part   \n",
       "42   Acceptance- and mindfulness-based intervention...  has part   \n",
       "..                                                 ...       ...   \n",
       "239                                   active treatment   part of   \n",
       "240                                   active treatment   part of   \n",
       "242                                   active treatment   part of   \n",
       "244                                   active treatment   part of   \n",
       "245                                   active treatment   part of   \n",
       "\n",
       "                                      5  \n",
       "37   mindfulness-based stress reduction  \n",
       "38   mindfulness-based stress reduction  \n",
       "39   mindfulness-based stress reduction  \n",
       "40   mindfulness-based stress reduction  \n",
       "42   mindfulness-based stress reduction  \n",
       "..                                  ...  \n",
       "239              differential treatment  \n",
       "240              differential treatment  \n",
       "242              differential treatment  \n",
       "244              differential treatment  \n",
       "245              differential treatment  \n",
       "\n",
       "[92 rows x 6 columns]"
      ]
     },
     "execution_count": 723,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "debugging[debugging[0] == \"h2\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e8cfa440-eba9-4d9a-b3bc-85f668a6b933",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "spacey_pipeline",
   "language": "python",
   "name": "spacey_pipeline"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
