{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "95fd390a-2935-41a1-b4d3-9ed3af67fd59",
   "metadata": {},
   "source": [
    "MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode)\n",
    "with collect(a) as list1,collect(b) as list2\n",
    "UNWIND list1 as a\n",
    "UNWIND list2 as b\n",
    "RETURN ID(a),ID(b),a.text,b.text,gds.alpha.linkprediction.adamicAdar(a, b) AS score ORDER BY score DESC"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "0c14889f-e4ca-46f4-8f52-cee51980710c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import db, config, StructuredNode, RelationshipTo, RelationshipFrom\n",
    "\n",
    "# Neomodel connection\n",
    "config.DATABASE_NAME = 'version1'\n",
    "db.set_connection(url='bolt://neo4j:12345678@localhost:7687')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "5a48d48f-725d-434d-92e4-7369f880b2c7",
   "metadata": {},
   "outputs": [],
   "source": [
    "results, meta = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode)\n",
    "with collect(a) as list1,collect(b) as list2\n",
    "UNWIND list1 as a\n",
    "UNWIND list2 as b\n",
    "RETURN ID(a),ID(b),a.text,b.text,gds.alpha.linkprediction.adamicAdar(a, b) AS score ORDER BY score DESC\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "d870694b-98c3-4221-bf88-3d2be465de2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "409ba45d-c0fa-4f57-9f03-c0923107d9c9",
   "metadata": {},
   "outputs": [],
   "source": [
    "results_df = pd.DataFrame(results,columns=meta)\n",
    "results_df = results_df.loc[(results_df['ID(a)'] != results_df['ID(b)']) & (results_df['ID(a)'] < results_df['ID(b)'])]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "c45d9c6e-8295-4f26-9b4e-02561611e3a4",
   "metadata": {},
   "outputs": [],
   "source": [
    "results, meta = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode) RETURN ID(a),ID(b),a.text,b.text\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "8c38ad45-01ee-4f58-905d-d37ed609c8c5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID(a)</th>\n",
       "      <th>ID(b)</th>\n",
       "      <th>a.text</th>\n",
       "      <th>b.text</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>144263</td>\n",
       "      <td>144193</td>\n",
       "      <td>pain catastrophizing</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>144193</td>\n",
       "      <td>144263</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain catastrophizing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>144851</td>\n",
       "      <td>144225</td>\n",
       "      <td>pain-related distress</td>\n",
       "      <td>pain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>144225</td>\n",
       "      <td>144851</td>\n",
       "      <td>pain</td>\n",
       "      <td>pain-related distress</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>144851</td>\n",
       "      <td>144225</td>\n",
       "      <td>pain-related distress</td>\n",
       "      <td>pain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>145349</td>\n",
       "      <td>144225</td>\n",
       "      <td>expectation</td>\n",
       "      <td>pain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>145410</td>\n",
       "      <td>145411</td>\n",
       "      <td>recovery</td>\n",
       "      <td>physical activities</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>145411</td>\n",
       "      <td>145410</td>\n",
       "      <td>physical activities</td>\n",
       "      <td>recovery</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>144225</td>\n",
       "      <td>145417</td>\n",
       "      <td>pain</td>\n",
       "      <td>depressive symptoms</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>145417</td>\n",
       "      <td>144225</td>\n",
       "      <td>depressive symptoms</td>\n",
       "      <td>pain</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>86 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     ID(a)   ID(b)                        a.text                        b.text\n",
       "0   144263  144193          pain catastrophizing  Cognitive-behavioral therapy\n",
       "1   144193  144263  Cognitive-behavioral therapy          pain catastrophizing\n",
       "2   144851  144225         pain-related distress                          pain\n",
       "3   144225  144851                          pain         pain-related distress\n",
       "4   144851  144225         pain-related distress                          pain\n",
       "..     ...     ...                           ...                           ...\n",
       "81  145349  144225                   expectation                          pain\n",
       "82  145410  145411                      recovery           physical activities\n",
       "83  145411  145410           physical activities                      recovery\n",
       "84  144225  145417                          pain           depressive symptoms\n",
       "85  145417  144225           depressive symptoms                          pain\n",
       "\n",
       "[86 rows x 4 columns]"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "existing_pairs_df = pd.DataFrame(results,columns=meta)\n",
    "existing_pairs_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "827c68bc-8ba5-4507-93ee-ec8735bc8caf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>a.text</th>\n",
       "      <th>b.text</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ID(a)</th>\n",
       "      <th>ID(b)</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th rowspan=\"4\" valign=\"top\">144193</th>\n",
       "      <th>144238</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144238</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144238</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144238</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144967</th>\n",
       "      <th>145247</th>\n",
       "      <td>difficulty in performing daily activities</td>\n",
       "      <td>muscle activation</td>\n",
       "      <td>0.378923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"5\" valign=\"top\">144225</th>\n",
       "      <th>145247</th>\n",
       "      <td>pain</td>\n",
       "      <td>muscle activation</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144360</th>\n",
       "      <td>pain</td>\n",
       "      <td>Behavioral therapy</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144485</th>\n",
       "      <td>pain</td>\n",
       "      <td>improvement</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144416</th>\n",
       "      <td>pain</td>\n",
       "      <td>post-treatment</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144234</th>\n",
       "      <td>pain</td>\n",
       "      <td>pain intensity</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3519 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                  a.text              b.text  \\\n",
       "ID(a)  ID(b)                                                                   \n",
       "144193 144238               Cognitive-behavioral therapy   pain interference   \n",
       "       144238               Cognitive-behavioral therapy   pain interference   \n",
       "       144238               Cognitive-behavioral therapy   pain interference   \n",
       "       144238               Cognitive-behavioral therapy   pain interference   \n",
       "144967 145247  difficulty in performing daily activities   muscle activation   \n",
       "...                                                  ...                 ...   \n",
       "144225 145247                                       pain   muscle activation   \n",
       "       144360                                       pain  Behavioral therapy   \n",
       "       144485                                       pain         improvement   \n",
       "       144416                                       pain      post-treatment   \n",
       "       144234                                       pain      pain intensity   \n",
       "\n",
       "                  score  \n",
       "ID(a)  ID(b)             \n",
       "144193 144238  0.389871  \n",
       "       144238  0.389871  \n",
       "       144238  0.389871  \n",
       "       144238  0.389871  \n",
       "144967 145247  0.378923  \n",
       "...                 ...  \n",
       "144225 145247  0.000000  \n",
       "       144360  0.000000  \n",
       "       144485  0.000000  \n",
       "       144416  0.000000  \n",
       "       144234  0.000000  \n",
       "\n",
       "[3519 rows x 3 columns]"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results_df.set_index(['ID(a)','ID(b)'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "8e709506-0be1-438b-9ab5-e460827f1e8a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((3519, 5), (3519, 3))"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "new_results = results_df.set_index(['ID(a)','ID(b)']).drop(existing_pairs_df[['ID(a)','ID(b)']])\n",
    "new_results = new_results.drop(existing_pairs_df[['ID(b)','ID(a)']]) # just in case\n",
    "results_df.shape,new_results.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "e19d1245-7a6b-4e1d-a749-6a09e416b816",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "196"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sum(new_results['score']>0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "aaa852c5-4c84-4572-8760-7fbb4b63981f",
   "metadata": {},
   "outputs": [],
   "source": [
    "new_results_no_dups = new_results.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "b99572d1-e863-455f-aebd-8933fa2dcc83",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "77"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sum(new_results_no_dups['score']>0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "1beab5ac-1fb7-42d3-951c-0d29084d2782",
   "metadata": {},
   "outputs": [],
   "source": [
    "all_results = {}\n",
    "all_results['AA'] = new_results_no_dups"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "b8f79287-f6ea-499f-bfa8-ecfd7357a853",
   "metadata": {},
   "outputs": [],
   "source": [
    "top_20 = new_results_no_dups.loc[new_results_no_dups['score']>0].iloc[:20]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "3228d5ba-4398-456e-bab9-693a9e2f6f2b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\\begin{tabular}{llr}\n",
      "\\toprule\n",
      "a.text & b.text & score \\\\\n",
      "\\midrule\n",
      "Cognitive-behavioral therapy & pain interference & 0.389871 \\\\\n",
      "difficulty in performing daily activities & muscle activation & 0.378923 \\\\\n",
      "pain catastrophizing & cognitive process & 0.296974 \\\\\n",
      "pain intensity & pain catastrophizing & 0.296974 \\\\\n",
      "pain intensity & pretreatment & 0.296974 \\\\\n",
      "pain intensity & cognitive process & 0.296974 \\\\\n",
      "pretreatment & pain catastrophizing & 0.296974 \\\\\n",
      "pretreatment & cognitive process & 0.296974 \\\\\n",
      "treatment epoch & pretreatment & 0.249543 \\\\\n",
      "treatment epoch & post-treatment & 0.249543 \\\\\n",
      "treatment epoch & BIO treatment condition & 0.249543 \\\\\n",
      "treatment epoch & body image disruption & 0.249543 \\\\\n",
      "treatment epoch & cognitive improvements & 0.249543 \\\\\n",
      "treatment epoch & neuromuscular activation & 0.249543 \\\\\n",
      "pain interference & BIO treatment condition & 0.249543 \\\\\n",
      "pain interference & body image disruption & 0.249543 \\\\\n",
      "pain interference & cognitive improvements & 0.249543 \\\\\n",
      "pain interference & neuromuscular activation & 0.249543 \\\\\n",
      "pretreatment & cognitive improvements & 0.249543 \\\\\n",
      "pretreatment & neuromuscular activation & 0.249543 \\\\\n",
      "\\bottomrule\n",
      "\\end{tabular}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(top_20.to_latex(index=False))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "3cb127bd-20be-4403-8447-4e7719d70094",
   "metadata": {},
   "outputs": [],
   "source": [
    "results, meta = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode)\n",
    "with collect(a) as list1,collect(b) as list2\n",
    "UNWIND list1 as a\n",
    "UNWIND list2 as b\n",
    "RETURN ID(a),ID(b),a.text,b.text,gds.alpha.linkprediction.preferentialAttachment(a, b) AS score ORDER BY score DESC\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "9ba14807-68bd-47a7-97bb-92700f7c3a4c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['ID(a)', 'ID(b)', 'a.text', 'b.text', 'score']"
      ]
     },
     "execution_count": 104,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "meta"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "1f95c208-3be0-4a4b-879d-a623df1d9e2b",
   "metadata": {},
   "outputs": [],
   "source": [
    "results_df = pd.DataFrame(results,columns=meta)\n",
    "results_df = results_df.loc[(results_df['ID(a)'] != results_df['ID(b)']) & (results_df['ID(a)'] < results_df['ID(b)'])]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "3196b58b-313f-43da-ba22-a9c73bed8002",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID(a)</th>\n",
       "      <th>ID(b)</th>\n",
       "      <th>a.text</th>\n",
       "      <th>b.text</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>199</th>\n",
       "      <td>144193</td>\n",
       "      <td>144225</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain</td>\n",
       "      <td>11832.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>200</th>\n",
       "      <td>144193</td>\n",
       "      <td>144225</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain</td>\n",
       "      <td>11832.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>201</th>\n",
       "      <td>144193</td>\n",
       "      <td>144225</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain</td>\n",
       "      <td>11832.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>202</th>\n",
       "      <td>144193</td>\n",
       "      <td>144225</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain</td>\n",
       "      <td>11832.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>203</th>\n",
       "      <td>144193</td>\n",
       "      <td>144225</td>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain</td>\n",
       "      <td>11832.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      ID(a)   ID(b)                        a.text b.text    score\n",
       "199  144193  144225  Cognitive-behavioral therapy   pain  11832.0\n",
       "200  144193  144225  Cognitive-behavioral therapy   pain  11832.0\n",
       "201  144193  144225  Cognitive-behavioral therapy   pain  11832.0\n",
       "202  144193  144225  Cognitive-behavioral therapy   pain  11832.0\n",
       "203  144193  144225  Cognitive-behavioral therapy   pain  11832.0"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "e4d4cad2-003d-45f3-8726-53e04cd48ec2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\\begin{tabular}{llr}\n",
      "\\toprule\n",
      "a.text & b.text & score \\\\\n",
      "\\midrule\n",
      "Cognitive-behavioral therapy & pain & 11832.000000 \\\\\n",
      "pain & pain intensity & 6380.000000 \\\\\n",
      "Cognitive-behavioral therapy & pain intensity & 5610.000000 \\\\\n",
      "pain & pain interference & 3364.000000 \\\\\n",
      "pain & Chronic pain & 3364.000000 \\\\\n",
      "Cognitive-behavioral therapy & Chronic pain & 2958.000000 \\\\\n",
      "Cognitive-behavioral therapy & pain interference & 2958.000000 \\\\\n",
      "pain & pain-related distress & 1624.000000 \\\\\n",
      "pain & Pain & 1624.000000 \\\\\n",
      "pain intensity & pain interference & 1595.000000 \\\\\n",
      "pain intensity & Chronic pain & 1595.000000 \\\\\n",
      "pain & pain catastrophizing & 1508.000000 \\\\\n",
      "Cognitive-behavioral therapy & pain-related distress & 1428.000000 \\\\\n",
      "Cognitive-behavioral therapy & Pain & 1428.000000 \\\\\n",
      "pain & treatment & 1392.000000 \\\\\n",
      "Cognitive-behavioral therapy & pain catastrophizing & 1326.000000 \\\\\n",
      "Cognitive-behavioral therapy & treatment & 1224.000000 \\\\\n",
      "pain interference & Chronic pain & 841.000000 \\\\\n",
      "pain intensity & pain-related distress & 770.000000 \\\\\n",
      "pain intensity & Pain & 770.000000 \\\\\n",
      "\\bottomrule\n",
      "\\end{tabular}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "results, meta = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode) RETURN ID(a),ID(b),a.text,b.text\"\"\")\n",
    "existing_pairs_df = pd.DataFrame(results,columns=meta)\n",
    "new_results = results_df.set_index(['ID(a)','ID(b)']).drop(existing_pairs_df[['ID(a)','ID(b)']])\n",
    "new_results = new_results.drop(existing_pairs_df[['ID(b)','ID(a)']]) # just in case\n",
    "results_df.shape,new_results.shape\n",
    "new_results_no_dups = new_results.drop_duplicates()\n",
    "top_20 = new_results_no_dups.loc[new_results_no_dups['score']>0].iloc[:20]\n",
    "print(top_20.to_latex(index=False))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "cc83362e-34e3-4982-aefd-ca68d709f09c",
   "metadata": {},
   "outputs": [],
   "source": [
    "all_results['pref'] = new_results_no_dups"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "9b8c5cfd-8bc9-4e26-9f32-c180ad5f6105",
   "metadata": {},
   "outputs": [],
   "source": [
    "results, meta = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode)\n",
    "with collect(a) as list1,collect(b) as list2\n",
    "UNWIND list1 as a\n",
    "UNWIND list2 as b\n",
    "RETURN ID(a),ID(b),a.text,b.text,gds.alpha.linkprediction.totalNeighbors(a, b) AS score ORDER BY score DESC\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "cd8677c6-1bd2-4ee1-b2e9-a82273b49762",
   "metadata": {},
   "outputs": [],
   "source": [
    "results_df = pd.DataFrame(results,columns=meta)\n",
    "results_df = results_df.loc[(results_df['ID(a)'] != results_df['ID(b)']) & (results_df['ID(a)'] < results_df['ID(b)'])]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "81d2708c-d999-4917-80c9-c31db0b92768",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\\begin{tabular}{llr}\n",
      "\\toprule\n",
      "a.text & b.text & score \\\\\n",
      "\\midrule\n",
      "Cognitive-behavioral therapy & pain & 215.000000 \\\\\n",
      "pain & pain intensity & 165.000000 \\\\\n",
      "Cognitive-behavioral therapy & pain intensity & 154.000000 \\\\\n",
      "pain & Chronic pain & 142.000000 \\\\\n",
      "pain & pain interference & 140.000000 \\\\\n",
      "Cognitive-behavioral therapy & Chronic pain & 131.000000 \\\\\n",
      "Cognitive-behavioral therapy & pain interference & 128.000000 \\\\\n",
      "pain & Pain & 127.000000 \\\\\n",
      "pain & pain catastrophizing & 126.000000 \\\\\n",
      "pain & pain-related distress & 124.000000 \\\\\n",
      "pain & treatment & 124.000000 \\\\\n",
      "pain & Behavioral therapy & 119.000000 \\\\\n",
      "pain & decrease in depressive symptoms & 117.000000 \\\\\n",
      "pain & positive changes & 116.000000 \\\\\n",
      "pain & cognitive process & 116.000000 \\\\\n",
      "pain & BIO treatment condition & 116.000000 \\\\\n",
      "pain & pain-related behaviors & 116.000000 \\\\\n",
      "pain & pain symptoms & 116.000000 \\\\\n",
      "pain & body image disruption & 116.000000 \\\\\n",
      "Cognitive-behavioral therapy & Pain & 116.000000 \\\\\n",
      "\\bottomrule\n",
      "\\end{tabular}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "results, meta = db.cypher_query(\"\"\"MATCH (a:MergedNode)-[r:VERB2 {text:\"has cause\"}]-(b:MergedNode) RETURN ID(a),ID(b),a.text,b.text\"\"\")\n",
    "existing_pairs_df = pd.DataFrame(results,columns=meta)\n",
    "new_results = results_df.set_index(['ID(a)','ID(b)']).drop(existing_pairs_df[['ID(a)','ID(b)']])\n",
    "new_results = new_results.drop(existing_pairs_df[['ID(b)','ID(a)']]) # just in case\n",
    "results_df.shape,new_results.shape\n",
    "new_results_no_dups = new_results.drop_duplicates()\n",
    "top_20 = new_results_no_dups.loc[new_results_no_dups['score']>0].iloc[:20]\n",
    "print(top_20.to_latex(index=False))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "a98ef87b-ee6c-446c-b1f3-e247c8b4fa01",
   "metadata": {},
   "outputs": [],
   "source": [
    "all_results['nn'] = new_results_no_dups"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "e6a7a4db-e07a-4d4e-9cda-ae7f876a9da8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1128, 3)"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_results['AA'].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "21329d45-bb9c-4fb8-891c-23c6d8b35ac2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1117, 3)"
      ]
     },
     "execution_count": 114,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_results['pref'].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "ac38894d-5019-44e8-bd86-4598f6b53119",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1128, 3)"
      ]
     },
     "execution_count": 115,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_results['nn'].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "5bf1d949-de70-4feb-8b86-321def3a2bb2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>a.text</th>\n",
       "      <th>b.text</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ID(a)</th>\n",
       "      <th>ID(b)</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>144193</th>\n",
       "      <th>144238</th>\n",
       "      <td>Cognitive-behavioral therapy</td>\n",
       "      <td>pain interference</td>\n",
       "      <td>0.389871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144967</th>\n",
       "      <th>145247</th>\n",
       "      <td>difficulty in performing daily activities</td>\n",
       "      <td>muscle activation</td>\n",
       "      <td>0.378923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144263</th>\n",
       "      <th>144699</th>\n",
       "      <td>pain catastrophizing</td>\n",
       "      <td>cognitive process</td>\n",
       "      <td>0.296974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">144234</th>\n",
       "      <th>144263</th>\n",
       "      <td>pain intensity</td>\n",
       "      <td>pain catastrophizing</td>\n",
       "      <td>0.296974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144239</th>\n",
       "      <td>pain intensity</td>\n",
       "      <td>pretreatment</td>\n",
       "      <td>0.296974</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                  a.text  \\\n",
       "ID(a)  ID(b)                                               \n",
       "144193 144238               Cognitive-behavioral therapy   \n",
       "144967 145247  difficulty in performing daily activities   \n",
       "144263 144699                       pain catastrophizing   \n",
       "144234 144263                             pain intensity   \n",
       "       144239                             pain intensity   \n",
       "\n",
       "                             b.text     score  \n",
       "ID(a)  ID(b)                                   \n",
       "144193 144238     pain interference  0.389871  \n",
       "144967 145247     muscle activation  0.378923  \n",
       "144263 144699     cognitive process  0.296974  \n",
       "144234 144263  pain catastrophizing  0.296974  \n",
       "       144239          pretreatment  0.296974  "
      ]
     },
     "execution_count": 116,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_results['AA'].head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "778af406-efcd-47a8-a792-970aefa1365e",
   "metadata": {},
   "outputs": [],
   "source": [
    "aa_score = all_results['AA']['score']\n",
    "aa_score.name = 'AA_score'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "id": "f27ef4c7-316e-4ebc-8608-4ac57dae86f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "pref_score = all_results['pref']['score']\n",
    "pref_score.name = 'pref_score'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "id": "1e53ebb1-7912-43a2-b646-28edd8e856d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "nn_score = all_results['nn']['score']\n",
    "nn_score.name = 'nn_score'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "id": "156e525b-6976-46c6-bb4c-9494b360e196",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>AA_score</th>\n",
       "      <th>pref_score</th>\n",
       "      <th>nn_score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ID(a)</th>\n",
       "      <th>ID(b)</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>144193</th>\n",
       "      <th>144238</th>\n",
       "      <td>0.389871</td>\n",
       "      <td>2958.0</td>\n",
       "      <td>128.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144967</th>\n",
       "      <th>145247</th>\n",
       "      <td>0.378923</td>\n",
       "      <td>4.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144263</th>\n",
       "      <th>144699</th>\n",
       "      <td>0.296974</td>\n",
       "      <td>52.0</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">144234</th>\n",
       "      <th>144263</th>\n",
       "      <td>0.296974</td>\n",
       "      <td>715.0</td>\n",
       "      <td>64.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144699</th>\n",
       "      <td>0.296974</td>\n",
       "      <td>220.0</td>\n",
       "      <td>54.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">144320</th>\n",
       "      <th>145044</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145091</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144253</th>\n",
       "      <th>144263</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>26.0</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">145350</th>\n",
       "      <th>145411</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145410</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1001 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               AA_score  pref_score  nn_score\n",
       "ID(a)  ID(b)                                 \n",
       "144193 144238  0.389871      2958.0     128.0\n",
       "144967 145247  0.378923         4.0       3.0\n",
       "144263 144699  0.296974        52.0      15.0\n",
       "144234 144263  0.296974       715.0      64.0\n",
       "       144699  0.296974       220.0      54.0\n",
       "...                 ...         ...       ...\n",
       "144320 145044  0.000000         4.0       4.0\n",
       "       145091  0.000000         4.0       4.0\n",
       "144253 144263  0.000000        26.0      15.0\n",
       "145350 145411  0.000000         4.0       4.0\n",
       "       145410  0.000000         4.0       4.0\n",
       "\n",
       "[1001 rows x 3 columns]"
      ]
     },
     "execution_count": 124,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "together = pd.concat((aa_score,pref_score,nn_score),axis=1).dropna()\n",
    "together"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "id": "f9df2bd8-6f02-464e-b5fb-d250d2d84e6a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "ID(a)   ID(b) \n",
       "144193  144225    215.0\n",
       "144225  144234    165.0\n",
       "144193  144234    154.0\n",
       "144225  144677    142.0\n",
       "        144238    140.0\n",
       "                  ...  \n",
       "144253  144320      3.0\n",
       "145140  145350      3.0\n",
       "        145240      3.0\n",
       "        145349      3.0\n",
       "        145417      3.0\n",
       "Name: nn_score, Length: 1128, dtype: float64"
      ]
     },
     "execution_count": 131,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nn_score"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "52e57557-31e3-41a8-a37e-5e88c8668217",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1128"
      ]
     },
     "execution_count": 130,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(nn_score)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "id": "42b27129-69af-4232-bedd-0d27bf41b26f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.05358387220277812"
      ]
     },
     "execution_count": 125,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import scipy.stats as stats\n",
    "aa_pref_tau, aa_pref_p_value = stats.kendalltau(together['AA_score'], together['pref_score'])\n",
    "aa_pref_tau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "id": "4019161f-ca21-4c74-a688-5d2d703799d7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.0"
      ]
     },
     "execution_count": 128,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aa_pref_p_value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "id": "8f56821b-ff08-428c-b635-29e19d0bd802",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.16544013639464636"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aa_pref_tau, aa_pref_p_value = stats.kendalltau(together['AA_score'], together['nn_score'])\n",
    "aa_pref_tau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "id": "af8e250f-ce6f-4dd2-a2a5-af3a779a4038",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.9422717867164249"
      ]
     },
     "execution_count": 127,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aa_pref_tau, aa_pref_p_value = stats.kendalltau(together['pref_score'], together['nn_score'])\n",
    "aa_pref_tau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "4b998695-bad9-460c-a9fd-acf1aa15a984",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "AA_score      1128\n",
       "pref_score    1117\n",
       "nn_score      1128\n",
       "dtype: int64"
      ]
     },
     "execution_count": 121,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "(pd.concat((aa_score,pref_score,nn_score),axis=1).isna()==False).sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "id": "1c4551e2-29c8-433a-bb24-d69d85ef1f7f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>AA_score</th>\n",
       "      <th>pref_score</th>\n",
       "      <th>nn_score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ID(a)</th>\n",
       "      <th>ID(b)</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>144193</th>\n",
       "      <th>144238</th>\n",
       "      <td>0.389871</td>\n",
       "      <td>2958.0</td>\n",
       "      <td>128.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144967</th>\n",
       "      <th>145247</th>\n",
       "      <td>0.378923</td>\n",
       "      <td>4.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144263</th>\n",
       "      <th>144699</th>\n",
       "      <td>0.296974</td>\n",
       "      <td>52.0</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">144234</th>\n",
       "      <th>144263</th>\n",
       "      <td>0.296974</td>\n",
       "      <td>715.0</td>\n",
       "      <td>64.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144239</th>\n",
       "      <td>0.296974</td>\n",
       "      <td>NaN</td>\n",
       "      <td>53.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"4\" valign=\"top\">144789</th>\n",
       "      <th>145140</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145240</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145349</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145417</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144535</th>\n",
       "      <th>144687</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1294 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               AA_score  pref_score  nn_score\n",
       "ID(a)  ID(b)                                 \n",
       "144193 144238  0.389871      2958.0     128.0\n",
       "144967 145247  0.378923         4.0       3.0\n",
       "144263 144699  0.296974        52.0      15.0\n",
       "144234 144263  0.296974       715.0      64.0\n",
       "       144239  0.296974         NaN      53.0\n",
       "...                 ...         ...       ...\n",
       "144789 145140       NaN         NaN       3.0\n",
       "       145240       NaN         NaN       3.0\n",
       "       145349       NaN         NaN       3.0\n",
       "       145417       NaN         NaN       3.0\n",
       "144535 144687       NaN         NaN       3.0\n",
       "\n",
       "[1294 rows x 3 columns]"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.concat((aa_score,pref_score,nn_score),axis=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "id": "7c2fb2b2-26a6-4b88-b409-8418d3234733",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "77"
      ]
     },
     "execution_count": 132,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sum(aa_score>0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "5aad99ca-0bb8-414a-81b0-85cd8c9f4d18",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "77"
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sum(aa_score!=0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a6d52acd-b1ae-4602-b9dd-e55116f8988d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "spacey_pipeline",
   "language": "python",
   "name": "spacey_pipeline"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
